## Football League Information System (FLIS) 
<p>Football League Information Syatem Database (flisDB) is a relational database schema that manages the information of a
football league for a given season. This FLIS consists of several teams, the teams' players, the
managers who manage the teams, the match information, scores, and the match referees.</p>

<p>The bellow lines of code connects us to the <code>Football_league_info_DB</code> database which contains <code>managers</code>,<code>match_referees</code>,
<code>matches</code>,<code>players</code>,<code>referees</code> and <code>teams</code> datasheets.</p>

In [1]:
import sqlalchemy as sq
sq.create_engine('sqlite:///Football_league_info_DB.db')
%load_ext sql
%sql sqlite:///Football_league_info_DB.db

## 1. Find the names and date-of-births of those managers who have joined in years 2019 and 2020

In [3]:
%%sql
SELECT mgr_name, dob
FROM managers
WHERE since BETWEEN '2019-01-01' AND '2020-12-31'

 * sqlite:///Football_league_info_DB.db
Done.

[('Jacob', '1990-08-23'), ('Brandon', '1995-02-15'), ('Adom', '1991-02-17')]

## 2. Find the names of all those teams where the last name of the team starts with the letter S.

In [4]:
%%sql
SELECT *
FROM teams
WHERE teams_name LIKE '_% S%'

 * sqlite:///Football_league_info_DB.db
Done.

[('T0005', 'All Stars', 'Pune', 'M S Maidan', 'Yellow', 'Pink')]

## 3. Find the names of players that start with ‘S’ but does not end with ‘n’.

In [7]:
%%sql
SELECT player_name
FROM players
WHERE player_name LIKE 'S%'
EXCEPT
SELECT player_name
FROM players
WHERE player_name LIKE '%n'

 * sqlite:///Football_league_info_DB.db
Done.

[('Shivansh',), ('Shlok',), ('Souvik',)]

## 4. Find out the total number of players who are playing from the team id ‘T0001’.

In [8]:
%%sql
SELECT COUNT(player_id)
FROM players
GROUP BY team_id
HAVING team_id = 'T0001'

 * sqlite:///Football_league_info_DB.db
Done.

[(11,)]

## 5. Write a SQL statement to find out the manager’s date of birth(dob) of the team for which “Shlok” plays

In [9]:
%%sql
SELECT dob
FROM managers
WHERE team_id IN (SELECT team_id
FROM players
WHERE player_name = 'Shlok')

 * sqlite:///Football_league_info_DB.db
Done.

[('1990-08-23',)]

## 6. Write a SQL statement to find out match number(match num) played in the playground“Emirates Stadium”.

In [23]:
%%sql
SELECT m.match_num
FROM matches as m,teams as t
WHERE m.host_team_id = t.team_id AND t.playground = 'Emirates Stadium'

 * sqlite:///Football_league_info_DB.db
Done.

[('M0001',), ('M0007',), ('M0016',)]

## 7. Find the name, player id, date of birth and city of all players who played for team‘Rainbow’.

In [22]:
%%sql
SELECT p.player_name, p.player_id, p.dob, t.city
FROM players AS p, teams AS t
WHERE p.team_id = t.team_id
AND t.teams_name = 'Rainbow'

 * sqlite:///Football_league_info_DB.db
Done.

[('Daksh', 'P3001', '2003-12-30', 'Moscow'),
 ('Aditya', 'P3002', '2004-11-29', 'Moscow'),
 ('Jay', 'P3003', '2004-10-28', 'Moscow'),
 ('Ravi', 'P3004', '2001-09-27', 'Moscow'),
 ('Suman', 'P3005', '2004-08-24', 'Moscow'),
 ('Souvik', 'P3006', '2003-07-22', 'Moscow'),
 ('Tanmoy', 'P3007', '2005-06-20', 'Moscow'),
 ('Arijit', 'P3008', '2003-05-15', 'Moscow'),
 ('Shivansh', 'P3009', '2003-04-22', 'Moscow'),
 ('Elvin', 'P3010', '2005-03-09', 'Moscow'),
 ('Kabir', 'P3011', '2003-02-08', 'Moscow'),
 ('Joseph', 'P3012', '2002-01-01', 'Moscow')]

## 8. Find the name of the teams which belong to the same city as the team ‘Amigos’.

In [24]:
%%sql
SELECT t2.teams_name
FROM teams AS t1, teams AS t2
WHERE t1.teams_name = 'Amigos'
AND t2.teams_name <> 'Amigos'
AND t1.city = t2.city

 * sqlite:///Football_league_info_DB.db
Done.

[]

## 9. Find the names of the fourth referees (fourth referee) and the match number of all matches played on “2020-05-19”.

In [26]:
%%sql
SELECT referee_name, match_num
FROM referees
INNER JOIN match_referees
ON referees.referee_id = match_referees.fourth_referee
INNER JOIN matches USING (match_num)
WHERE match_date = '2020-05-19'

 * sqlite:///Football_league_info_DB.db
Done.

[('Asit Kumar Sarkar', 'M0008')]

## 10. Write a SQL statement to find out the name of the oldest player from the team named“All Stars”.

In [30]:
%%sql
SELECT p.player_name
FROM players as p
WHERE p.dob = (SELECT MIN(pl.dob)
FROM players pl, teams te
WHERE te.team_id = pl.team_id
AND te.teams_name = 'All Stars')

 * sqlite:///Football_league_info_DB.db
Done.

[('Stephen',)]